// 'number'+3+3; // Результат - "number33". Оператор додавання об'єднує число з рядком , перетворюючи число в рядок(конкатенація).
 
// null + 3; // Результат - 0. null -це 0 , тому виходить 0+3 = 3.

 // 5 && "qwerty"; // Результат - "qwerty". Тому що обидва правдиві значення і логічний оператор "І" повернтає останнє правдиве значення.
  
 /* +'40' + +'2' + "hillel"; // Результат - "42hillel". Оператор "унарний +" перетворює рядок в число , 40+2=42, а потім число поєднується + з рядком , 
  пертворюючись в рядок(конкатенація) */

// '10' - 5 === 6; // Результат - false. Оператор віднімання перетворює рядок в число 10-5=5 , а 5 не дорівнює 6 (=== - оператор строгої рівності).

// true + false; // Результат - 1. Тому що true - 1 , false - 0. 1+0=1.

// '4px' - 3; // Результат - NaN. Оператор віднімання перетворює рядок число , але якщо у рядку немає літер, тільки цифри. 

// '4' - 3; // Результат - 1. Оператор віднімання перетворює рядок в число, 4-3=1.

// '6' + 3 ** 0; // Результат - "61". Спочатку викунується зведення в ступінь , 3**0= 1, а вже потім оператор додавання об'єднує число з рядком , перетворюючи число в рядок.

// 12 / '6'; // Результат - 2. Оператор ділення перетворює рядок в число, тому 12/6 = 2 .

// null == ''; // Результат - false. В цьому випадку null та "" завжди приводяться до false .

// 3 ** (9 / 3); Результата - 27. Спершу виконується ділення , а потім зведення в ступінь.

// !!'false' == !!'true'; // Результат - true. 'false' та 'true' - це рядок ,тобто, це правдиві значення, а оператор "!!" - короткий спосіб перетворення на булеве значення.

/* 0 || '0' && 1; // Результа - Результат - 1. Спочатку викунується логічний оператор && , тому в що в нього вищий пріоритет. "0" та 1 -це обидва правильні значення, тому &&
повертає останнє правдиве значення - 1. Оператор "||" повертає перше правдиве значення , 0 - хибне, тому переходить до наступного, до 1.*/

// (+null == false) < 1; // Результат - false. Оператор "Унарний +" перетворює null на 0, 0 == false - це true(1), 1<1 - це false.

/* false && true || true; // результат - true. Оператор "&&" виконується першим бо має вищий пріоритет, повертається перше хибне значення , тобто false. 
 false||true - оператор "||" повертає перше правдиве значення , тобто true. */

 /* false && (false || true); // Результат - false. Спочатку виконується дія в дужках. "||" повертає перше правдиве значення , тобто true. 
  false && true - "&&" повертає перше хибне значення , тобто false */

  /* (+null == false) < 1 ** 5; // Результат - false. Спочатку виконується дія в дужках, потім зведення в ступінь , а потім порівняння.
   Оператор "Унарний +" пертворює null у 0 - це правдиве значення , тобто true(1). 1**5 = 1. 1 < 1 - це хибне значення , тобто false.*/